In [1]:
#Target Guided Ordianal Encoding

In [2]:
#ordering the lables according to the target
#replace the labels by the joint probablity of being 1 and 0


#we will be using the titanic dataset

import pandas as pd

In [4]:
dataset = pd.read_csv('train.csv')

In [5]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
dataset = dataset[['Cabin','Survived']]

In [9]:
dataset.head()

  Cabin  Survived
0   NaN         0
1   C85         1
2   NaN         1
3  C123         1
4   NaN         0

In [25]:
dataset['Cabin']=dataset['Cabin'].fillna("Missing")

In [26]:
#Now i will try to extract the first character of the cabin values

dataset['Cabin_Encode']=dataset['Cabin'].astype(str).str[0]

In [27]:
#now to see the unique values of the cabin column

dataset.head()

     Cabin  Survived Cabin_Encode
0  Missing         0            M
1      C85         1            C
2  Missing         1            M
3     C123         1            C
4  Missing         0            M

In [28]:
dataset.Cabin_Encode.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [33]:
ordinal_values=dataset.groupby(['Cabin_Encode'])['Survived'].mean().sort_values().index

In [34]:
print(ordinal_values)

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin_Encode')

In [35]:
enumerate(ordinal_values,0)

The enumerate() function assigns an index to each item in an iterable object that can be used to reference the item later

In [36]:
labelling={k:i for i,k in enumerate(ordinal_values,0)}

In [37]:
labelling

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [38]:
#so it has assigned the ranks

In [45]:
dataset['Ranked']=dataset['Cabin_Encode'].map(labelling)

In [47]:
dataset.drop(['Ranked_Ordinals'],axis=1)

       Cabin  Survived Cabin_Encode  Ranked
0    Missing         0            M       1
1        C85         1            C       4
2    Missing         1            M       1
3       C123         1            C       4
4    Missing         0            M       1
..       ...       ...          ...     ...
886  Missing         0            M       1
887      B42         1            B       6
888  Missing         0            M       1
889     C148         1            C       4
890  Missing         0            M       1

[891 rows x 4 columns]

In [ ]:
#so we have provided the ranks :)